RT-Thread/rt-thread/bsp/freescale/platform/devices/MK53D10/include/MK53D10.h
#define LCD_WF8B_BPCLCD27_SHIFT                  2
#define LCD_WF8B_BPCLCD27_WIDTH                  1
#define LCD_WF8B_BPCLCD27(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD27_SHIFT))&LCD_WF8B_BPCLCD27_MASK)
#define LCD_WF8B_BPCLCD17_MASK                   0x4u
#define LCD_WF8B_BPCLCD17_SHIFT                  2
#define LCD_WF8B_BPCLCD17_WIDTH                  1
#define LCD_WF8B_BPCLCD17(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD17_SHIFT))&LCD_WF8B_BPCLCD17_MASK)
#define LCD_WF8B_BPCLCD51_MASK                   0x4u
#define LCD_WF8B_BPCLCD51_SHIFT                  2
#define LCD_WF8B_BPCLCD51_WIDTH                  1
#define LCD_WF8B_BPCLCD51(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD51_SHIFT))&LCD_WF8B_BPCLCD51_MASK)
#define LCD_WF8B_BPCLCD9_MASK                    0x4u
#define LCD_WF8B_BPCLCD9_SHIFT                   2
#define LCD_WF8B_BPCLCD9_WIDTH                   1
#define LCD_WF8B_BPCLCD9(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD9_SHIFT))&LCD_WF8B_BPCLCD9_MASK)
#define LCD_WF8B_BPCLCD54_MASK                   0x4u
#define LCD_WF8B_BPCLCD54_SHIFT                  2
#define LCD_WF8B_BPCLCD54_WIDTH                  1
#define LCD_WF8B_BPCLCD54(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD54_SHIFT))&LCD_WF8B_BPCLCD54_MASK)
#define LCD_WF8B_BPCLCD15_MASK                   0x4u
#define LCD_WF8B_BPCLCD15_SHIFT                  2
#define LCD_WF8B_BPCLCD15_WIDTH                  1
#define LCD_WF8B_BPCLCD15(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD15_SHIFT))&LCD_WF8B_BPCLCD15_MASK)
#define LCD_WF8B_BPCLCD16_MASK                   0x4u
#define LCD_WF8B_BPCLCD16_SHIFT                  2
#define LCD_WF8B_BPCLCD16_WIDTH                  1
#define LCD_WF8B_BPCLCD16(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD16_SHIFT))&LCD_WF8B_BPCLCD16_MASK)
#define LCD_WF8B_BPCLCD14_MASK                   0x4u
#define LCD_WF8B_BPCLCD14_SHIFT                  2
#define LCD_WF8B_BPCLCD14_WIDTH                  1
#define LCD_WF8B_BPCLCD14(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD14_SHIFT))&LCD_WF8B_BPCLCD14_MASK)
#define LCD_WF8B_BPCLCD32_MASK                   0x4u
#define LCD_WF8B_BPCLCD32_SHIFT                  2
#define LCD_WF8B_BPCLCD32_WIDTH                  1
#define LCD_WF8B_BPCLCD32(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD32_SHIFT))&LCD_WF8B_BPCLCD32_MASK)
#define LCD_WF8B_BPCLCD28_MASK                   0x4u
#define LCD_WF8B_BPCLCD28_SHIFT                  2
#define LCD_WF8B_BPCLCD28_WIDTH                  1
#define LCD_WF8B_BPCLCD28(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD28_SHIFT))&LCD_WF8B_BPCLCD28_MASK)
#define LCD_WF8B_BPCLCD53_MASK                   0x4u
#define LCD_WF8B_BPCLCD53_SHIFT                  2
#define LCD_WF8B_BPCLCD53_WIDTH                  1
#define LCD_WF8B_BPCLCD53(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD53_SHIFT))&LCD_WF8B_BPCLCD53_MASK)
#define LCD_WF8B_BPCLCD33_MASK                   0x4u
#define LCD_WF8B_BPCLCD33_SHIFT                  2
#define LCD_WF8B_BPCLCD33_WIDTH                  1
#define LCD_WF8B_BPCLCD33(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD33_SHIFT))&LCD_WF8B_BPCLCD33_MASK)
#define LCD_WF8B_BPCLCD0_MASK                    0x4u
#define LCD_WF8B_BPCLCD0_SHIFT                   2
#define LCD_WF8B_BPCLCD0_WIDTH                   1
#define LCD_WF8B_BPCLCD0(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD0_SHIFT))&LCD_WF8B_BPCLCD0_MASK)
#define LCD_WF8B_BPCLCD43_MASK                   0x4u
#define LCD_WF8B_BPCLCD43_SHIFT                  2
#define LCD_WF8B_BPCLCD43_WIDTH                  1
#define LCD_WF8B_BPCLCD43(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD43_SHIFT))&LCD_WF8B_BPCLCD43_MASK)
#define LCD_WF8B_BPCLCD7_MASK                    0x4u
#define LCD_WF8B_BPCLCD7_SHIFT                   2
#define LCD_WF8B_BPCLCD7_WIDTH                   1
#define LCD_WF8B_BPCLCD7(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD7_SHIFT))&LCD_WF8B_BPCLCD7_MASK)
#define LCD_WF8B_BPCLCD4_MASK                    0x4u
#define LCD_WF8B_BPCLCD4_SHIFT                   2
#define LCD_WF8B_BPCLCD4_WIDTH                   1
#define LCD_WF8B_BPCLCD4(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD4_SHIFT))&LCD_WF8B_BPCLCD4_MASK)
#define LCD_WF8B_BPCLCD34_MASK                   0x4u
#define LCD_WF8B_BPCLCD34_SHIFT                  2
#define LCD_WF8B_BPCLCD34_WIDTH                  1
#define LCD_WF8B_BPCLCD34(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD34_SHIFT))&LCD_WF8B_BPCLCD34_MASK)
#define LCD_WF8B_BPCLCD29_MASK                   0x4u
#define LCD_WF8B_BPCLCD29_SHIFT                  2
#define LCD_WF8B_BPCLCD29_WIDTH                  1
#define LCD_WF8B_BPCLCD29(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD29_SHIFT))&LCD_WF8B_BPCLCD29_MASK)
#define LCD_WF8B_BPCLCD45_MASK                   0x4u
#define LCD_WF8B_BPCLCD45_SHIFT                  2
#define LCD_WF8B_BPCLCD45_WIDTH                  1
#define LCD_WF8B_BPCLCD45(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD45_SHIFT))&LCD_WF8B_BPCLCD45_MASK)
#define LCD_WF8B_BPCLCD57_MASK                   0x4u
#define LCD_WF8B_BPCLCD57_SHIFT                  2
#define LCD_WF8B_BPCLCD57_WIDTH                  1
#define LCD_WF8B_BPCLCD57(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD57_SHIFT))&LCD_WF8B_BPCLCD57_MASK)
#define LCD_WF8B_BPCLCD42_MASK                   0x4u
#define LCD_WF8B_BPCLCD42_SHIFT                  2
#define LCD_WF8B_BPCLCD42_WIDTH                  1
#define LCD_WF8B_BPCLCD42(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD42_SHIFT))&LCD_WF8B_BPCLCD42_MASK)
#define LCD_WF8B_BPCLCD35_MASK                   0x4u
#define LCD_WF8B_BPCLCD35_SHIFT                  2
#define LCD_WF8B_BPCLCD35_WIDTH                  1
#define LCD_WF8B_BPCLCD35(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD35_SHIFT))&LCD_WF8B_BPCLCD35_MASK)
#define LCD_WF8B_BPCLCD13_MASK                   0x4u
#define LCD_WF8B_BPCLCD13_SHIFT                  2
#define LCD_WF8B_BPCLCD13_WIDTH                  1
#define LCD_WF8B_BPCLCD13(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD13_SHIFT))&LCD_WF8B_BPCLCD13_MASK)
#define LCD_WF8B_BPCLCD36_MASK                   0x4u
#define LCD_WF8B_BPCLCD36_SHIFT                  2
#define LCD_WF8B_BPCLCD36_WIDTH                  1
#define LCD_WF8B_BPCLCD36(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD36_SHIFT))&LCD_WF8B_BPCLCD36_MASK)
#define LCD_WF8B_BPCLCD30_MASK                   0x4u
#define LCD_WF8B_BPCLCD30_SHIFT                  2
#define LCD_WF8B_BPCLCD30_WIDTH                  1
#define LCD_WF8B_BPCLCD30(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD30_SHIFT))&LCD_WF8B_BPCLCD30_MASK)
#define LCD_WF8B_BPCLCD52_MASK                   0x4u
#define LCD_WF8B_BPCLCD52_SHIFT                  2
#define LCD_WF8B_BPCLCD52_WIDTH                  1
#define LCD_WF8B_BPCLCD52(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD52_SHIFT))&LCD_WF8B_BPCLCD52_MASK)
#define LCD_WF8B_BPCLCD58_MASK                   0x4u
#define LCD_WF8B_BPCLCD58_SHIFT                  2
#define LCD_WF8B_BPCLCD58_WIDTH                  1
#define LCD_WF8B_BPCLCD58(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD58_SHIFT))&LCD_WF8B_BPCLCD58_MASK)
#define LCD_WF8B_BPCLCD41_MASK                   0x4u
#define LCD_WF8B_BPCLCD41_SHIFT                  2
#define LCD_WF8B_BPCLCD41_WIDTH                  1
#define LCD_WF8B_BPCLCD41(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD41_SHIFT))&LCD_WF8B_BPCLCD41_MASK)
#define LCD_WF8B_BPCLCD37_MASK                   0x4u
#define LCD_WF8B_BPCLCD37_SHIFT                  2
#define LCD_WF8B_BPCLCD37_WIDTH                  1
#define LCD_WF8B_BPCLCD37(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD37_SHIFT))&LCD_WF8B_BPCLCD37_MASK)
#define LCD_WF8B_BPCLCD3_MASK                    0x4u
#define LCD_WF8B_BPCLCD3_SHIFT                   2
#define LCD_WF8B_BPCLCD3_WIDTH                   1
#define LCD_WF8B_BPCLCD3(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD3_SHIFT))&LCD_WF8B_BPCLCD3_MASK)
#define LCD_WF8B_BPCLCD12_MASK                   0x4u
#define LCD_WF8B_BPCLCD12_SHIFT                  2
#define LCD_WF8B_BPCLCD12_WIDTH                  1
#define LCD_WF8B_BPCLCD12(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD12_SHIFT))&LCD_WF8B_BPCLCD12_MASK)
#define LCD_WF8B_BPCLCD11_MASK                   0x4u
#define LCD_WF8B_BPCLCD11_SHIFT                  2
#define LCD_WF8B_BPCLCD11_WIDTH                  1
#define LCD_WF8B_BPCLCD11(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD11_SHIFT))&LCD_WF8B_BPCLCD11_MASK)
#define LCD_WF8B_BPCLCD38_MASK                   0x4u
#define LCD_WF8B_BPCLCD38_SHIFT                  2
#define LCD_WF8B_BPCLCD38_WIDTH                  1
#define LCD_WF8B_BPCLCD38(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD38_SHIFT))&LCD_WF8B_BPCLCD38_MASK)
#define LCD_WF8B_BPCLCD44_MASK                   0x4u
#define LCD_WF8B_BPCLCD44_SHIFT                  2
#define LCD_WF8B_BPCLCD44_WIDTH                  1
#define LCD_WF8B_BPCLCD44(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD44_SHIFT))&LCD_WF8B_BPCLCD44_MASK)
#define LCD_WF8B_BPCLCD31_MASK                   0x4u
#define LCD_WF8B_BPCLCD31_SHIFT                  2
#define LCD_WF8B_BPCLCD31_WIDTH                  1
#define LCD_WF8B_BPCLCD31(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD31_SHIFT))&LCD_WF8B_BPCLCD31_MASK)
#define LCD_WF8B_BPCLCD40_MASK                   0x4u
#define LCD_WF8B_BPCLCD40_SHIFT                  2
#define LCD_WF8B_BPCLCD40_WIDTH                  1
#define LCD_WF8B_BPCLCD40(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD40_SHIFT))&LCD_WF8B_BPCLCD40_MASK)
#define LCD_WF8B_BPCLCD62_MASK                   0x4u
#define LCD_WF8B_BPCLCD62_SHIFT                  2
#define LCD_WF8B_BPCLCD62_WIDTH                  1
#define LCD_WF8B_BPCLCD62(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD62_SHIFT))&LCD_WF8B_BPCLCD62_MASK)
#define LCD_WF8B_BPCLCD56_MASK                   0x4u
#define LCD_WF8B_BPCLCD56_SHIFT                  2
#define LCD_WF8B_BPCLCD56_WIDTH                  1
#define LCD_WF8B_BPCLCD56(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD56_SHIFT))&LCD_WF8B_BPCLCD56_MASK)
#define LCD_WF8B_BPCLCD39_MASK                   0x4u
#define LCD_WF8B_BPCLCD39_SHIFT                  2
#define LCD_WF8B_BPCLCD39_WIDTH                  1
#define LCD_WF8B_BPCLCD39(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD39_SHIFT))&LCD_WF8B_BPCLCD39_MASK)
#define LCD_WF8B_BPCLCD6_MASK                    0x4u
#define LCD_WF8B_BPCLCD6_SHIFT                   2
#define LCD_WF8B_BPCLCD6_WIDTH                   1
#define LCD_WF8B_BPCLCD6(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPCLCD6_SHIFT))&LCD_WF8B_BPCLCD6_MASK)
#define LCD_WF8B_BPDLCD47_MASK                   0x8u
#define LCD_WF8B_BPDLCD47_SHIFT                  3
#define LCD_WF8B_BPDLCD47_WIDTH                  1
#define LCD_WF8B_BPDLCD47(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD47_SHIFT))&LCD_WF8B_BPDLCD47_MASK)
#define LCD_WF8B_BPDLCD23_MASK                   0x8u
#define LCD_WF8B_BPDLCD23_SHIFT                  3
#define LCD_WF8B_BPDLCD23_WIDTH                  1
#define LCD_WF8B_BPDLCD23(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD23_SHIFT))&LCD_WF8B_BPDLCD23_MASK)
#define LCD_WF8B_BPDLCD48_MASK                   0x8u
#define LCD_WF8B_BPDLCD48_SHIFT                  3
#define LCD_WF8B_BPDLCD48_WIDTH                  1
#define LCD_WF8B_BPDLCD48(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD48_SHIFT))&LCD_WF8B_BPDLCD48_MASK)
#define LCD_WF8B_BPDLCD24_MASK                   0x8u
#define LCD_WF8B_BPDLCD24_SHIFT                  3
#define LCD_WF8B_BPDLCD24_WIDTH                  1
#define LCD_WF8B_BPDLCD24(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD24_SHIFT))&LCD_WF8B_BPDLCD24_MASK)
#define LCD_WF8B_BPDLCD15_MASK                   0x8u
#define LCD_WF8B_BPDLCD15_SHIFT                  3
#define LCD_WF8B_BPDLCD15_WIDTH                  1
#define LCD_WF8B_BPDLCD15(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD15_SHIFT))&LCD_WF8B_BPDLCD15_MASK)
#define LCD_WF8B_BPDLCD22_MASK                   0x8u
#define LCD_WF8B_BPDLCD22_SHIFT                  3
#define LCD_WF8B_BPDLCD22_WIDTH                  1
#define LCD_WF8B_BPDLCD22(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD22_SHIFT))&LCD_WF8B_BPDLCD22_MASK)
#define LCD_WF8B_BPDLCD60_MASK                   0x8u
#define LCD_WF8B_BPDLCD60_SHIFT                  3
#define LCD_WF8B_BPDLCD60_WIDTH                  1
#define LCD_WF8B_BPDLCD60(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD60_SHIFT))&LCD_WF8B_BPDLCD60_MASK)
#define LCD_WF8B_BPDLCD10_MASK                   0x8u
#define LCD_WF8B_BPDLCD10_SHIFT                  3
#define LCD_WF8B_BPDLCD10_WIDTH                  1
#define LCD_WF8B_BPDLCD10(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD10_SHIFT))&LCD_WF8B_BPDLCD10_MASK)
#define LCD_WF8B_BPDLCD21_MASK                   0x8u
#define LCD_WF8B_BPDLCD21_SHIFT                  3
#define LCD_WF8B_BPDLCD21_WIDTH                  1
#define LCD_WF8B_BPDLCD21(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD21_SHIFT))&LCD_WF8B_BPDLCD21_MASK)
#define LCD_WF8B_BPDLCD49_MASK                   0x8u
#define LCD_WF8B_BPDLCD49_SHIFT                  3
#define LCD_WF8B_BPDLCD49_WIDTH                  1
#define LCD_WF8B_BPDLCD49(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD49_SHIFT))&LCD_WF8B_BPDLCD49_MASK)
#define LCD_WF8B_BPDLCD1_MASK                    0x8u
#define LCD_WF8B_BPDLCD1_SHIFT                   3
#define LCD_WF8B_BPDLCD1_WIDTH                   1
#define LCD_WF8B_BPDLCD1(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD1_SHIFT))&LCD_WF8B_BPDLCD1_MASK)
#define LCD_WF8B_BPDLCD25_MASK                   0x8u
#define LCD_WF8B_BPDLCD25_SHIFT                  3
#define LCD_WF8B_BPDLCD25_WIDTH                  1
#define LCD_WF8B_BPDLCD25(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD25_SHIFT))&LCD_WF8B_BPDLCD25_MASK)
#define LCD_WF8B_BPDLCD20_MASK                   0x8u
#define LCD_WF8B_BPDLCD20_SHIFT                  3
#define LCD_WF8B_BPDLCD20_WIDTH                  1
#define LCD_WF8B_BPDLCD20(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD20_SHIFT))&LCD_WF8B_BPDLCD20_MASK)
#define LCD_WF8B_BPDLCD2_MASK                    0x8u
#define LCD_WF8B_BPDLCD2_SHIFT                   3
#define LCD_WF8B_BPDLCD2_WIDTH                   1
#define LCD_WF8B_BPDLCD2(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD2_SHIFT))&LCD_WF8B_BPDLCD2_MASK)
#define LCD_WF8B_BPDLCD55_MASK                   0x8u
#define LCD_WF8B_BPDLCD55_SHIFT                  3
#define LCD_WF8B_BPDLCD55_WIDTH                  1
#define LCD_WF8B_BPDLCD55(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD55_SHIFT))&LCD_WF8B_BPDLCD55_MASK)
#define LCD_WF8B_BPDLCD59_MASK                   0x8u
#define LCD_WF8B_BPDLCD59_SHIFT                  3
#define LCD_WF8B_BPDLCD59_WIDTH                  1
#define LCD_WF8B_BPDLCD59(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD59_SHIFT))&LCD_WF8B_BPDLCD59_MASK)
#define LCD_WF8B_BPDLCD5_MASK                    0x8u
#define LCD_WF8B_BPDLCD5_SHIFT                   3
#define LCD_WF8B_BPDLCD5_WIDTH                   1
#define LCD_WF8B_BPDLCD5(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD5_SHIFT))&LCD_WF8B_BPDLCD5_MASK)
#define LCD_WF8B_BPDLCD19_MASK                   0x8u
#define LCD_WF8B_BPDLCD19_SHIFT                  3
#define LCD_WF8B_BPDLCD19_WIDTH                  1
#define LCD_WF8B_BPDLCD19(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD19_SHIFT))&LCD_WF8B_BPDLCD19_MASK)
#define LCD_WF8B_BPDLCD6_MASK                    0x8u
#define LCD_WF8B_BPDLCD6_SHIFT                   3
#define LCD_WF8B_BPDLCD6_WIDTH                   1
#define LCD_WF8B_BPDLCD6(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD6_SHIFT))&LCD_WF8B_BPDLCD6_MASK)
#define LCD_WF8B_BPDLCD26_MASK                   0x8u
#define LCD_WF8B_BPDLCD26_SHIFT                  3
#define LCD_WF8B_BPDLCD26_WIDTH                  1
#define LCD_WF8B_BPDLCD26(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD26_SHIFT))&LCD_WF8B_BPDLCD26_MASK)
#define LCD_WF8B_BPDLCD0_MASK                    0x8u
#define LCD_WF8B_BPDLCD0_SHIFT                   3
#define LCD_WF8B_BPDLCD0_WIDTH                   1
#define LCD_WF8B_BPDLCD0(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD0_SHIFT))&LCD_WF8B_BPDLCD0_MASK)
#define LCD_WF8B_BPDLCD50_MASK                   0x8u
#define LCD_WF8B_BPDLCD50_SHIFT                  3
#define LCD_WF8B_BPDLCD50_WIDTH                  1
#define LCD_WF8B_BPDLCD50(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD50_SHIFT))&LCD_WF8B_BPDLCD50_MASK)
#define LCD_WF8B_BPDLCD46_MASK                   0x8u
#define LCD_WF8B_BPDLCD46_SHIFT                  3
#define LCD_WF8B_BPDLCD46_WIDTH                  1
#define LCD_WF8B_BPDLCD46(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD46_SHIFT))&LCD_WF8B_BPDLCD46_MASK)
#define LCD_WF8B_BPDLCD18_MASK                   0x8u
#define LCD_WF8B_BPDLCD18_SHIFT                  3
#define LCD_WF8B_BPDLCD18_WIDTH                  1
#define LCD_WF8B_BPDLCD18(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD18_SHIFT))&LCD_WF8B_BPDLCD18_MASK)
#define LCD_WF8B_BPDLCD61_MASK                   0x8u
#define LCD_WF8B_BPDLCD61_SHIFT                  3
#define LCD_WF8B_BPDLCD61_WIDTH                  1
#define LCD_WF8B_BPDLCD61(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD61_SHIFT))&LCD_WF8B_BPDLCD61_MASK)
#define LCD_WF8B_BPDLCD9_MASK                    0x8u
#define LCD_WF8B_BPDLCD9_SHIFT                   3
#define LCD_WF8B_BPDLCD9_WIDTH                   1
#define LCD_WF8B_BPDLCD9(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD9_SHIFT))&LCD_WF8B_BPDLCD9_MASK)
#define LCD_WF8B_BPDLCD17_MASK                   0x8u
#define LCD_WF8B_BPDLCD17_SHIFT                  3
#define LCD_WF8B_BPDLCD17_WIDTH                  1
#define LCD_WF8B_BPDLCD17(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD17_SHIFT))&LCD_WF8B_BPDLCD17_MASK)
#define LCD_WF8B_BPDLCD27_MASK                   0x8u
#define LCD_WF8B_BPDLCD27_SHIFT                  3
#define LCD_WF8B_BPDLCD27_WIDTH                  1
#define LCD_WF8B_BPDLCD27(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD27_SHIFT))&LCD_WF8B_BPDLCD27_MASK)
#define LCD_WF8B_BPDLCD53_MASK                   0x8u
#define LCD_WF8B_BPDLCD53_SHIFT                  3
#define LCD_WF8B_BPDLCD53_WIDTH                  1
#define LCD_WF8B_BPDLCD53(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD53_SHIFT))&LCD_WF8B_BPDLCD53_MASK)
#define LCD_WF8B_BPDLCD51_MASK                   0x8u
#define LCD_WF8B_BPDLCD51_SHIFT                  3
#define LCD_WF8B_BPDLCD51_WIDTH                  1
#define LCD_WF8B_BPDLCD51(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD51_SHIFT))&LCD_WF8B_BPDLCD51_MASK)
#define LCD_WF8B_BPDLCD54_MASK                   0x8u
#define LCD_WF8B_BPDLCD54_SHIFT                  3
#define LCD_WF8B_BPDLCD54_WIDTH                  1
#define LCD_WF8B_BPDLCD54(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD54_SHIFT))&LCD_WF8B_BPDLCD54_MASK)
#define LCD_WF8B_BPDLCD13_MASK                   0x8u
#define LCD_WF8B_BPDLCD13_SHIFT                  3
#define LCD_WF8B_BPDLCD13_WIDTH                  1
#define LCD_WF8B_BPDLCD13(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD13_SHIFT))&LCD_WF8B_BPDLCD13_MASK)
#define LCD_WF8B_BPDLCD16_MASK                   0x8u
#define LCD_WF8B_BPDLCD16_SHIFT                  3
#define LCD_WF8B_BPDLCD16_WIDTH                  1
#define LCD_WF8B_BPDLCD16(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD16_SHIFT))&LCD_WF8B_BPDLCD16_MASK)
#define LCD_WF8B_BPDLCD32_MASK                   0x8u
#define LCD_WF8B_BPDLCD32_SHIFT                  3
#define LCD_WF8B_BPDLCD32_WIDTH                  1
#define LCD_WF8B_BPDLCD32(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD32_SHIFT))&LCD_WF8B_BPDLCD32_MASK)
#define LCD_WF8B_BPDLCD14_MASK                   0x8u
#define LCD_WF8B_BPDLCD14_SHIFT                  3
#define LCD_WF8B_BPDLCD14_WIDTH                  1
#define LCD_WF8B_BPDLCD14(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD14_SHIFT))&LCD_WF8B_BPDLCD14_MASK)
#define LCD_WF8B_BPDLCD28_MASK                   0x8u
#define LCD_WF8B_BPDLCD28_SHIFT                  3
#define LCD_WF8B_BPDLCD28_WIDTH                  1
#define LCD_WF8B_BPDLCD28(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD28_SHIFT))&LCD_WF8B_BPDLCD28_MASK)
#define LCD_WF8B_BPDLCD43_MASK                   0x8u
#define LCD_WF8B_BPDLCD43_SHIFT                  3
#define LCD_WF8B_BPDLCD43_WIDTH                  1
#define LCD_WF8B_BPDLCD43(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD43_SHIFT))&LCD_WF8B_BPDLCD43_MASK)
#define LCD_WF8B_BPDLCD4_MASK                    0x8u
#define LCD_WF8B_BPDLCD4_SHIFT                   3
#define LCD_WF8B_BPDLCD4_WIDTH                   1
#define LCD_WF8B_BPDLCD4(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD4_SHIFT))&LCD_WF8B_BPDLCD4_MASK)
#define LCD_WF8B_BPDLCD45_MASK                   0x8u
#define LCD_WF8B_BPDLCD45_SHIFT                  3
#define LCD_WF8B_BPDLCD45_WIDTH                  1
#define LCD_WF8B_BPDLCD45(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD45_SHIFT))&LCD_WF8B_BPDLCD45_MASK)
#define LCD_WF8B_BPDLCD8_MASK                    0x8u
#define LCD_WF8B_BPDLCD8_SHIFT                   3
#define LCD_WF8B_BPDLCD8_WIDTH                   1
#define LCD_WF8B_BPDLCD8(x)                      (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD8_SHIFT))&LCD_WF8B_BPDLCD8_MASK)
#define LCD_WF8B_BPDLCD62_MASK                   0x8u
#define LCD_WF8B_BPDLCD62_SHIFT                  3
#define LCD_WF8B_BPDLCD62_WIDTH                  1
#define LCD_WF8B_BPDLCD62(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD62_SHIFT))&LCD_WF8B_BPDLCD62_MASK)
#define LCD_WF8B_BPDLCD33_MASK                   0x8u
#define LCD_WF8B_BPDLCD33_SHIFT                  3
#define LCD_WF8B_BPDLCD33_WIDTH                  1
#define LCD_WF8B_BPDLCD33(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD33_SHIFT))&LCD_WF8B_BPDLCD33_MASK)
#define LCD_WF8B_BPDLCD34_MASK                   0x8u
#define LCD_WF8B_BPDLCD34_SHIFT                  3
#define LCD_WF8B_BPDLCD34_WIDTH                  1
#define LCD_WF8B_BPDLCD34(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD34_SHIFT))&LCD_WF8B_BPDLCD34_MASK)
#define LCD_WF8B_BPDLCD29_MASK                   0x8u
#define LCD_WF8B_BPDLCD29_SHIFT                  3
#define LCD_WF8B_BPDLCD29_WIDTH                  1
#define LCD_WF8B_BPDLCD29(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD29_SHIFT))&LCD_WF8B_BPDLCD29_MASK)
#define LCD_WF8B_BPDLCD58_MASK                   0x8u
#define LCD_WF8B_BPDLCD58_SHIFT                  3
#define LCD_WF8B_BPDLCD58_WIDTH                  1
#define LCD_WF8B_BPDLCD58(x)                     (((uint8_t)(((uint8_t)(x))<<LCD_WF8B_BPDLCD58_SHIFT))&LCD_WF8B_BPDLCD58_MASK)
